app/controllers/beacons_controller.rb

SELECT  "beacons".* FROM "beacons" WHERE (name LIKE '%a%' AND owners.id = '%5')  ORDER BY name asc LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "beacons" WHERE (name LIKE '%t%')
---
  def index
    @beacons = Beacon.search(params[:search], params[:owner_id])
                     .order(sort_column + " " + sort_direction)
                     .paginate(:page => params[:page], :per_page => 3)

SELECT  "owners".* FROM "owners" WHERE "owners"."id" = $1 LIMIT 1  [["id", nil]]
---
  def new
    @beacon = Beacon.new

    $owner = Owner.find(params[:id])

INSERT INTO "beacons" ("name", "factory_id", "description", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Para volver"], ["factory_id", "132isdksj-3nrwe"], ["description", ""], ["owner_id", 1], ["created_at", "2015-02-13 18:34:04.586574"], ["updated_at", "2015-02-13 18:34:04.586574"]]
---
  def create
    #beacon.owner_id = params[:id]
    @beacon = Beacon.new(beacon_params)
    @beacon.owner_id = $owner.id

    respond_to do |format|
      status_code = Beacon.gimbal_create_beacon(@beacon)
      if status_code == "200"
        if @beacon.save

DELETE FROM "beacons" WHERE "beacons"."id" = $1  [["id", 3]]
---
  def destroy
    @beacon.destroy

SELECT  "beacons".* FROM "beacons" WHERE "beacons"."id" = $1 LIMIT 1  [["id", 8]]
---
    def set_beacon
      @beacon = Beacon.find(params[:id])