app/controllers/owners_controller.rb

  def index
   # @owners = Owner.all
    @owners = Owner.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:per_page => 3, :page => params[:page])
---
SELECT  "owners".* FROM "owners" WHERE (name LIKE '%%')  ORDER BY created_at asc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "owners" WHERE (name LIKE '%Arkus%')

  def show
    @beacons = @owner.beacons
    @beacons.each {
---
SELECT "beacons".* FROM "beacons" WHERE "beacons"."owner_id" = $1  [["owner_id", 1]]

  def create
    @owner = Owner.new(owner_params)

    respond_to do |format|
      if @owner.save
---
INSERT INTO "owners" ("name", "image", "description", "owner_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Omar"], ["image", "test.png"], ["description", "Test"], ["owner_type", "Company"], ["created_at", "2015-02-12 17:44:59.469240"], ["updated_at", "2015-02-12 17:44:59.469240"]]

  def update
    respond_to do |format|
      if @owner.update(owner_params)
---
UPDATE "owners" SET "owner_type" = $1, "updated_at" = $2 WHERE "owners"."id" = $3  [["owner_type", "Event"], ["updated_at", "2015-02-17 18:31:44.664522"], ["id", 1]]

    def set_owner
      @owner = Owner.find(params[:id])
---
SELECT  "owners".* FROM "owners" WHERE "owners"."id" = $1 LIMIT 1  [["id", 1]]